GT1/turbulent_planar/turbulent_planar_kO/turbulent_planar_kO_HRN_WF/turbulent_planar_kO_HRN_WF_low_I/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

//internalField   uniform 1e-12;
internalField   uniform 0.00015;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        //type            fixedValue;
        //value           uniform 1e-12;
        //value           $internalField;

	//To enable wall function - Best for HRN 
        type	          kqRWallFunction;
        value             uniform 1e-12;
	//value           $internalField;

	//LRN-HRN  *Does not give right profile with (1)
        //type	          kLowReWallFunction;
        //value            uniform 1e-12;

//(1) OK for LaunderSharmaKE
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
    bottom
    {
        type            symmetry;
    }
}

// ************************************************************************* //
