GT1/turbulent_planar/turbulent_planar_kO/turbulent_planar_kO_HRN_WF/turbulent_planar_kO_HRN_WF_low_I/system/sampleDict0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

interpolationScheme cellPoint;

/*
cell
cellPatchConstrained
cellPoint
cellPointFace
cellPointWallModified
pointMVC
*/

setFormat       raw;

// Fields to sample.
fields
(
    U
    p
    wallShearStress
    //U.component(0) 
);

sets
(

    profile0						
    {						
	type	lineCell;					
	axis 	distance; //y;	

	start		(	7.996	0	0.05	);
	end		(	7.996	0.1	0.05	);	
    }							

    profile1						
    {							
	type	lineUniform;
	nPoints 1000;
	axis 	distance; //y;	

	start		(	7.996	0	0.05	);
	end		(	7.996	0.1	0.05	);	
    }											
    
);

// *********************************************************************** //
